# Creating a *`DataFrame`*
* ### `DataFrame` is an another datatype in Python.
* ### `DataFrame` is basically a bunch of series placed together veritcally. |||

In [251]:
import numpy as np 
import pandas as pd

## Creating `DataFrame`
### There are multiple ways to create a `Pandas` `DataFrame`:

In [252]:
employees_dataset_dict = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
employees_df1 = pd.DataFrame(data=employees_dataset_dict)

In [253]:
employees_df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [254]:
columns :list[str]= ["Name","Age","City","Salary"]

employees_dataset_list :list[list]= [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

employees_df2 = pd.DataFrame(data= employees_dataset_list,columns =columns)

In [255]:
employees_df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

### `Selection` and `Indexing` of Columns

In [256]:
#Single column would be shown as a series:
employees_df2['Salary']

0    65000
1    70000
2    62000
3    85000
Name: Salary, dtype: int64

In [257]:
#Multiple columns would be shown as DataFrames:
employees_df2[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

### `Creating` a new column

In [258]:
employees_df2['Position'] = ["Doctor","Eng.","Doctor","Eng."]

In [259]:
employees_df2

    Name  Age      City  Salary Position
0   John   28  New York   65000   Doctor
1   Anna   34     Paris   70000     Eng.
2  Peter   29    Berlin   62000   Doctor
3  Linda   42    London   85000     Eng.

### `Removing` Columns

In [260]:
df=employees_df2.copy()

In [261]:
df.drop(labels=['City'], axis=1, inplace= False)

    Name  Age  Salary Position
0   John   28   65000   Doctor
1   Anna   34   70000     Eng.
2  Peter   29   62000   Doctor
3  Linda   42   85000     Eng.

In [262]:
"""
    If the inplace is False then the drop will not affect the DataFrame and will just view a copy.
"""
df.drop(columns=['City'], inplace=False)

    Name  Age  Salary Position
0   John   28   65000   Doctor
1   Anna   34   70000     Eng.
2  Peter   29   62000   Doctor
3  Linda   42   85000     Eng.

In [263]:
df

    Name  Age      City  Salary Position
0   John   28  New York   65000   Doctor
1   Anna   34     Paris   70000     Eng.
2  Peter   29    Berlin   62000   Doctor
3  Linda   42    London   85000     Eng.

In [264]:
df.drop(columns=['City'], inplace=True)
df

    Name  Age  Salary Position
0   John   28   65000   Doctor
1   Anna   34   70000     Eng.
2  Peter   29   62000   Doctor
3  Linda   42   85000     Eng.

### `Removing` Rows:

In [ ]:
df2=employees_df2.copy()

In [266]:
df2.drop(labels=0, axis = 0, inplace=False)

    Name  Age    City  Salary Position
1   Anna   34   Paris   70000     Eng.
2  Peter   29  Berlin   62000   Doctor
3  Linda   42  London   85000     Eng.

In [267]:
df2.drop(index=0, axis = 0, inplace=False)

    Name  Age    City  Salary Position
1   Anna   34   Paris   70000     Eng.
2  Peter   29  Berlin   62000   Doctor
3  Linda   42  London   85000     Eng.

### Selecting `Rows`

In [ ]:
df.loc[[0, 1]]
#locate 0th and 1st row

   Name  Age  Salary Position
0  John   28   65000   Doctor
1  Anna   34   70000     Eng.

In [276]:
employees_df1.iloc[3]
#locate row based based on index

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

### Selection of a `certain part` of `DataFrame`:

In [270]:
employees_df1.loc[[0,1]][["City","Salary"]]

       City  Salary
0  New York   65000
1     Paris   70000

### Conditional Selection | `Masking`

In [277]:
condition=employees_df2["Age"] > 30

employees_df2[condition]

    Name  Age    City  Salary Position
1   Anna   34   Paris   70000     Eng.
3  Linda   42  London   85000     Eng.

#### I only want poeple whose age is above 30 and their city must be paris

In [283]:
condition2=(employees_df1['Age']>30) & (employees_df1['City']=="Paris")

df[condition2]

   Name  Age  Salary Position
1  Anna   34   70000     Eng.